In [1]:
import pandas as pd

n = {"a": [1,2],
    "b": [2,6],
    "c": [6,6],
    "d": [7,9]}

df1 = pd.DataFrame(n)

In [2]:
g = {"t": [7,4,2],
    "u": [6,2,7],
    "v": [9,7,5],
    "w": [1,5,8]}

df2 = pd.DataFrame(g)

In [3]:
df2

   t  u  v  w
0  7  6  9  1
1  4  2  7  5
2  2  7  5  8

In [4]:
pd.concat([df1, df2], ignore_index=True)

     a    b    c    d    t    u    v    w
0  1.0  2.0  6.0  7.0  NaN  NaN  NaN  NaN
1  2.0  6.0  6.0  9.0  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  7.0  6.0  9.0  1.0
3  NaN  NaN  NaN  NaN  4.0  2.0  7.0  5.0
4  NaN  NaN  NaN  NaN  2.0  7.0  5.0  8.0

In [5]:
df1_col, df2_col = list(df1.columns), list(df2.columns)

In [6]:
df2.rename(columns=dict(zip(df2_col, df1_col)), inplace = True)

In [7]:
df2

   a  b  c  d
0  7  6  9  1
1  4  2  7  5
2  2  7  5  8

In [8]:
pd.concat([df1, df2], ignore_index=True)

   a  b  c  d
0  1  2  6  7
1  2  6  6  9
2  7  6  9  1
3  4  2  7  5
4  2  7  5  8

In [9]:
print(df1)
df1.describe() # Defines the statistical description or distribution of the data-set

   a  b  c  d
0  1  2  6  7
1  2  6  6  9

              a         b    c         d
count  2.000000  2.000000  2.0  2.000000
mean   1.500000  4.000000  6.0  8.000000
std    0.707107  2.828427  0.0  1.414214
min    1.000000  2.000000  6.0  7.000000
25%    1.250000  3.000000  6.0  7.500000
50%    1.500000  4.000000  6.0  8.000000
75%    1.750000  5.000000  6.0  8.500000
max    2.000000  6.000000  6.0  9.000000

In [10]:
16/5

3.2

In [11]:
df2['a'].isin(df1)

0    False
1    False
2    False
Name: a, dtype: bool

In [12]:
df2

   a  b  c  d
0  7  6  9  1
1  4  2  7  5
2  2  7  5  8

In [13]:
df1

   a  b  c  d
0  1  2  6  7
1  2  6  6  9

In [14]:
df1['a'].isin(df2)

0    False
1    False
Name: a, dtype: bool

In [15]:
# remember first, gather data, then explore(read), then filter (remove unecessary columns) and like checking if NaN. then manipulating the data